Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: For double byte character set versions of the system, this is the height of the Kanji window at the bottom of the screen, in pixels.
ja: ダブルバイト文字セットのバージョンでは、画面下部の漢字ウィンドウの高さをピクセルで表します。

source: For each VT_BYREF parameter, an unnamed temporary var is created, the value is copied from the caller's variable, and a VarRef is passed to the AutoHotkey function/method.
ja: 各VT_BYREFパラメータに対して、無名の一時的なvarが作成され、値が呼び出し元の変数からコピーされ、VarRefがAutoHotkey関数/メソッドに渡されます。

source: For each built-in function or function definition within the script, there is a corresponding read-only variable containing a Func object.
ja: スクリプト内の各組込み関数または関数定義に対して、Funcオブジェクトを含む対応する読み取り専用変数が存在します。

source: For each variable in the list, the variable's name and contents are shown, along with other information depending on what the variable contains.
ja: リスト内の各変数について、変数の名前と内容が表示され、変数が含む内容に応じて他の情報も表示されます。

source: For example "Edit1" is the first control with classname "Edit".
ja: 例えば、「Edit1」はクラス名「Edit」を持つ最初のコントロールです。

source: For example {:U} or {:.20Ts}.
ja: 例えば{:U}や {:.20Ts}のようなものです。

source: For example ^a::b produces normal B, not Ctrl+B.
ja: 例えば、^a::bは、Ctrl+Bではなく、通常のBを出力します。

source: For example a+ matches ab and aaab.
ja: 例えばa+は abとaaabにマッチする。

source: For example calling CharLower(CharUpper(MyVar)) in a programming language would convert MyVar's contents to lowercase.
ja: 例えば、プログラミング言語でCharLower(CharUpper(MyVar))を呼び出すと、MyVarの内容が小文字に変換されます。

source: For example, "A2" is considered less than "A10".
ja: 例えば、「A2」は「A10」よりも小さいとみなされる。

source: For example, "Edit1" is the first Edit control on a window and "Button12" is the twelth button.
ja: 例えば、「Edit1」はウィンドウ上の最初のEditコントロール、「Button12」は2番目のボタンです。

source: For example, "Notepad" could match both "Untitled - Notepad" and "C:\A\B.ahk - Notepad++".
ja: 例えば、「Notepad」は、「Untitled - Notepad」と「C:\A\B.ahk - Notepad++」の両方にマッチする可能性があります。

source: For example, "SysListView321" is the window's first ListView control, not its 321st.
ja: 例えば、"SysListView321 "はウィンドウの最初のListViewコントロールであり、321番目のListViewコントロールではない。

source: For example, 'A' always has the character code 65.
ja: 例えば、'A'は常に文字コード65を持つ。

source: For example, -1 extracts the last character and -2 extracts the two last characters.
ja: 例えば、-1は最後の1文字を抽出し、-2は最後の2文字を抽出する。

source: For example, -1 has the same bit representation as the unsigned 64-bit integer 0xffffffffffffffff, therefore -1 >>> 1 is 0x7fffffffffffffff.
ja: 例えば、-1は符号なし64ビット整数0xffffffffffffと同じビット表現を持つので、-1 >>> 1は0x7fffffffffffffとなる。

source: For example, -1 starts at the last character and -2 starts at the next-to-last character.
ja: 例えば、-1は最後の文字から、-2はその次の文字から始まります。

source: For example, -2 searches for the second occurrence from the right.
ja: 例えば、-2は右から2番目に出現するものを検索します。

source: For example, 09 is 9am and 21 is 9pm.
ja: 例えば、09は午前9時、21は午後9時です。

source: For example, 0xC0000005 means "access violation".
ja: 例えば、0xC0000005は「アクセス違反」を意味します。

source: For example, 2 is the second icon.
ja: 例えば、2は2番目のアイコンです。

source: For example, 2joy1 is the second controller's first button.
ja: 例えば、2joy1は2つ目のコントローラーの最初のボタン。

source: For example, 2joy1 is the second joystick's first button.
ja: 例えば、2joy1は2番目のジョイスティックの第1ボタンです。

source: For example, A_Clipboard retrieves the current contents of the clipboard as text, and A_TimeSinceThisHotkey calculates the number of milliseconds that have elapsed since the hotkey was pressed.
ja: 例えば、A_Clipboardはクリップボードの現在の内容をテキストとして取得し、A_TimeSinceThisHotkeyはホットキーが押されてから経過したミリ秒数を計算します。

source: For example, MsgBox would display only the portion of the string before the first binary zero.
ja: 例えば、MsgBoxは、文字列のうち最初の2進数のゼロより前の部分のみを表示します。

source: For example, Array has a Length property which corresponds to the number of elements in the array.
ja: 例えば、Arrayには、配列の要素数に相当するLengthプロパティがあります。

source: For example, RegExMatch stores the substring that matches each subpattern in its output array.
ja: 例えば、RegExMatchは各サブパターンにマッチする部分文字列を出力配列に格納する。

source: For example, StrLen returns the number of characters in a string.
ja: 例えば、StrLenは文字列の文字数を返します。

source: For example, WinMove moves a window, so its parameters tell it which window to move and where to move it to.
ja: 例えば、WinMoveはウィンドウを移動させるので、どのウィンドウをどこに移動させるかをパラメータで指定します。

source: For example, ControlSend can send keyboard messages directly to the window.
ja: 例えば、ControlSendはキーボードメッセージを直接ウィンドウに送信することができます。

source: For example, "*C:\" would initially select the C drive.
ja: 例えば、"*C:\"とすると、最初はCドライブが選択されます。

source: For example, "1&" indicates the first item.
ja: 例えば、"1&"は最初の項目を示します。

source: For example, "C:\My Folder *C:\My Folder\Projects" would not allow the user to navigate any higher than C:\My Folder (but the initial selection would be C:\My Folder\Projects).
ja: 例えば、"C:\My Folder *C:\My Folder\Projects"とすると、「C:\My Folder」より上位には移動できません（ただし、初期選択では「C:\My Folder\Projects」になります）。

source: For example, "D", "D:" or "D:\".
ja: 例えば、"D"、"D:"または"D:\"。

source: For example, "Line In:2" uses the second component named "Line In".
ja: 例えば、"Line In:2"は「Line In」という名前の2番目のコンポーネントを使う。

source: For example, "M", 1 and "M1" are all valid (but not equivalent).
ja: 例えば、"M"、1、"M1"はすべて有効です（ただし、同等ではありません）。

source: For example, "MessageBox" is the same as "MessageBoxW".
ja: 例えば、"MessageBox"は"MessageBoxW"と同じです。

source: For example, "Speakers" or "Speakers (Example HD Audio)".
ja: 例えば、"Speakers"または"Speakers (Example HD Audio)"です。

source: For example, "Speakers:2" indicates the second device which has a name starting with "Speakers".
ja: 例えば、"Speakers:2"は、"Speakers"で始まる名前を持つ2台目のデバイスを示す。

source: For example, "https://someorg.org" might retrieve the welcome page for that organization.
ja: 例えば、"https://someorg.org"、その組織のウェルカムページを取得することができるかもしれません。

source: For example, "{2:i} {:i}" formats the second and third input values as decimal integers, separated by a space.
ja: 例えば、"{2:i} {:i}"は、2番目と3番目の入力値を、スペースで区切った10進数の整数としてフォーマットします。

source: For example, #Include <lib> and #Include <lib_func> would both include lib.ahk from one of the Lib folders.
ja: 例えば、#Include <lib>と#Include <lib_func>は、どちらもLibフォルダの一つからlib.ahkをインクルードします。

source: For example, #Space is Win+Space and ^!Tab is Ctrl+Alt+Tab.
ja: 例えば、#SpaceはWin+Space、^!TabはCtrl+Alt+Tabです。

source: For example, #include <lib> and #include <lib_func> would both include lib.ahk from one of the Lib folders.
ja: 例えば、#include<lib>と#include<lib_func>は、どちらもLib フォルダの1つにある lib.ahk をインクルードします。

source: For example, $#a:: in combination with AppsKey::RWin causes masking when Menu+A is pressed, but Menu on its own is able to open the Start Menu.
ja: 例えば、$#a::とAppsKey::RWinの組み合わせでは、Menu+Aを押したときにマスクが発生しますが、Menu単体ではスタートメニューを開くことができます。

source: For example, (3 + 2) * 2 forces 3 + 2 to be evaluated first.
ja: 例えば、(3 + 2) * 2とすると、3 + 2が最初に評価される。

source: For example, +HA-R.
ja: 例えば、+HA-R。

source: For example, +x::+y will no longer release RShift to press LShift.
ja: 例えば、+x::+yは、RShiftを離してLShiftを押すことができなくなります。

source: For example, 0.1 is a number but 0.min and 0.1.min access the min property which can be handled by a base object (see Primitive Values).
ja: 例えば、0.1は数値ですが、0.minと 0.1.minは、ベースオブジェクトが扱えるminプロパティにアクセスします（プリミティブ値参照）。

source: For example, 1.3-alpha would produce a binary version number of 1.3.0.0.
ja: たとえば、1.3-alphaなら、バイナリのバージョン番号は1.3.0.0となる。

source: For example, 1, "1" and ":1" use the first component regardless of name, whereas "" uses the master controls.
ja: 例えば、1、"1"、":1"は、名前に関係なく最初のコンポーネントを使用するが、""はマスターコントロールを使用する。

source: For example, 1, "Line in" or "Line in:2".
ja: 例えば、1、"Line in"または"Line in:2"。

source: For example, 1, "Speakers", "Speakers:2" or "Speakers (Example HD Audio)".
ja: 例えば、1、"Speakers"、"Speakers:2"、"Speakers (Example HD Audio)"などです。

source: For example, 2 would load the default icon from the second icon group.
ja: 例えば、2は2番目のアイコングループからデフォルトのアイコンをロードする。

source: For example, 2Joy1 would be the second controller's first button.
ja: 例えば、2Joy1は、2つ目のコントローラーの最初のボタンとなる。

source: For example, 42 and 42.0 are usually interchangeable, but not always.
ja: 例えば、42と 42.0は通常互換性がありますが、常に互換性があるわけではありません。

source: For example, ::5`:::6 is now 5: → 6 rather than an error, and ::7`::::8 is now 7: → :8 rather than 7:: → 8.
ja: 例えば、::5`:::6はエラーではなく5: → 6 となり、::7`::::8 は 7:: → 8 よりも 7: → :8 となっています。

source: For example, ComObjActive("Word.Application") will fail because Word is not marked for UI Access.
ja: 例えば、ComObjActive("Word.Application")は、WordがUIアクセス用にマークされていないため、失敗します。

source: For example, >^a:: corresponds to RCtrl+A, but to send that combination, you need to spell out the key name in full, as in Send "{RCtrl down}a{RCtrl up}".
ja: 例えば、>^a::はRCtrl+Aに対応しますが、この組み合わせを送信するには、Send "{RCtrl down}a{RCtrl up}"のように、キー名をフルスペルで記述する必要があります。

source: For example, Array(mymap*) creates an array containing the keys of mymap.
ja: 例えば、Array(mymap*)は、mymapのキーを含む配列を作成します。

source: For example, Click 100, 200, "R D" is equivalent to Click "100 200 R D" and both are valid.
ja: 例えば、Click 100, 200, "R D"は、Click "100 200 R D"と同義で、いずれも動作します。

source: For example, ComValue(0xB, true) creates an object which represents the COM boolean value true.
ja: 例えば、ComValue(0xB, true)は、COM のブール値trueを表すオブジェクトを作成します。

source: For example, D, D: or D:\.
ja: 例えば、D、D:、D:\など。

source: For example, DoNotUseArray%n+1% and %(%triple%)% are valid.
ja: 例えば、DoNotUseArray%n+1%や %(%triple%)%は有効です。

source: For example, F.Bind(,b).Call(a,c) calls F(a,b,c) rather than F(,b,a,c).
ja: 例えば、F.Bind(,b).Call(a,c)はF(,b,a,c)ではなくF(a,b,c)を呼び出します。

source: For example, File.Pos(n) is not valid.
ja: 例えば、File.Pos(n)は有効ではありません。

source: For example, Format("{:#.0f}", 1) returns 1..
ja: 例えば、Format("{:#.0f}", 1)は1.を返します。

source: For example, Format("{:+d}", 1) returns +1.
ja: 例えば、Format("{:+d}", 1)は、+1を返します。

source: For example, Format("{:-10}", 1) returns 1 .
ja: 例えば、Format("{:-10}", 1)は 1 を返します。

source: For example, Format("{:d}", 1.23) returns 1.
ja: 例えば、Format("{:d}", 1.23)は1を返します。

source: For example, Format("{:o}", 255) returns 377.
ja: 例えば、Format("{:o}", 255)は377を返します。

source: For example, Format("{:p}", 255) returns 00000000000000FF.
ja: 例えば、Format("{:p}", 255)は、00000000000000FFを返します。

source: For example, Format("{:p}", 255) returns 000000FF.
ja: 例えば、Format("{:p}", 255)は、000000FFを返します。

source: For example, HasBase(Obj, Array.Prototype) is true if Obj is an instance of Array or any derived class.
ja: 例えば、HasBase(Obj, Array.Prototype)は、Objが Array またはその派生クラスのインスタンスのときに真となります。

source: For example, InStr(a, b,, -1, 2) now searches left-to-right.
ja: 例えば、InStr(a, b,, -1, 2)は左から右へ検索するようになりました。

source: For example, MsgBox 0x1 is equivalent to MsgBox 1, while MsgBox 1.0000 is equivalent to MsgBox 1.0 (because the float formatting has changed).
ja: 例えば、MsgBox 0x1はMsgBox 1と同等であり、MsgBox 1.0000はMsgBox 1.0と同等です（浮動小数点数のフォーマットが変更されたため）。

source: For example, MsgBox(myObject) shows an empty MsgBox.
ja: 例えば、MsgBox(myObject)は、空のMsgBoxを表示します。

source: For example, MyArray%A_Index% or MyGrid%X%_%Y%.
ja: 例えば、MyArray%A_Index%や、または MyGrid%X%_%Y%。

source: For example, MyFn((x, y)) evaluates both x and y but passes y as the first and only parameter of MyFn.
ja: 例えば、MyFn((x, y))はxとyの両方を評価するが、MyFnの最初の唯一のパラメーターとしてyを渡す。

source: For example, MyFunc()+1 is currently allowed, although the +1 has no effect and its result is discarded.
ja: 例えば、MyFunc()+1は現在許可されていますが、+1は何の効果もなく、その結果は破棄されます。

source: For example, MyFunc() would call the function object contained by MyFunc, which could be either the actual name of a function, or just a variable which has been assigned a function.
ja: 例えば、MyFunc()は、MyFuncに含まれる関数オブジェクトを呼び出しますが、これは実際の関数名であったり、関数が割り当てられた変数であったりすることがあります。

source: For example, MyFunc() would call the value MyFunc regardless of whether that is the function's actual name or a variable containing a function object, and (a?b:c)() would call either b or c depending on a.
ja: 例えば、MyFunc()は、それが関数の実際の名前か関数オブジェクトを含む変数かにかかわらず、値MyFuncを呼び出し、(a?b:c)()は、aに応じてbまたはcを呼び出します。

source: For example, MyFunc() would call the value of MyFunc regardless of whether that is the function's actual name or a variable containing a function object, and (a?b:c)() would call either b or c depending on a.
ja: 例えば、MyFunc()は、それが関数の実際の名前か関数オブジェクトを含む変数かにかかわらず、値MyFuncを呼び出し、(a?b:c)()は、aに応じてbまたはcを呼び出します。

source: For example, MyFunc(x, y*) is supported but MyFunc(x*, y) is not.
ja: 例えば、MyFunc(x, y*)はサポートされていますが、MyFunc(x*, y)はサポートされていません。

source: For example, Random(9) returns a number between 0 and 9.
ja: 例えば、Random(9)は0から9の間の数を返します。

source: For example, Run '"My Program.exe" "param with spaces"'.
ja: 例えば Run '"My Program.exe" "param with spaces"'.

source: For example, Run 'MyProgram.exe Param1 Param2'.
ja: 例えば、Run 'MyProgram.exe Param1 Param2'

source: For example, Run 'my.exe "A\" B' might produce a parameter with the value A" B instead of two parameters.
ja: 例えば、Run 'my.exe "A\" B'は2つのパラメーターの代わりに値A" Bのパラメーターを生成するかもしれない。

source: For example, Send "^A" sends the combination of Ctrl with upper-case "a", so Ctrl+Shift+A.
ja: 例えば、Send "^A"、Ctrlと 大文字の「a」の組み合わせになるので、Ctrl+Shift+Aで送信します。

source: For example, Send "a" may behave similar to Send "{Blind}{Ctrl up}a{Ctrl down}" if the user is physically holding Ctrl, but Send "{Ctrl Down}" followed by Send "a" will produce Ctrl+A.
ja: 例えば、Send "a" は、ユーザーが物理的にCtrlを持っている場合、Send "{Blind}{Ctrl up}a{Ctrl down}" と同様の動作をすることがあります、 が、Send "{Ctrl Down}"の後にSend "a"を送るとCtrl+Aとなる。

source: For example, Send "{µ up}" has no effect on most layouts, and Send "{µ down}" is equivalent to Send "µ".
ja: 例えば、Send "{µ up}"は、ほとんどのレイアウトで効果がなく、Send "{µ down}"はSend "µ"と同等であることを示しています。

source: For example, Sleep 0xFF is equivalent to Sleep 255.
ja: 例えば、Sleep 0xFFは Sleep 255に相当します。

source: For example, WinExist("ahk_id " ahwnd " ahk_class " aclass) returns ahwnd if the window is "detected" (according to DetectHiddenWindows) and its window class matches the string contained by aclass.
ja: 例えば、WinExist("ahk_id " ahwnd " ahk_class " aclass)は、ウィンドウが（DetectHiddenWindowsに従って）"検出"され、そのウィンドウクラスがaclassに含まれる文字列と一致する場合、ahwndを返す。

source: For example, ^space::Send "{Ctrl up}" automatically pushes Ctrl back down if the user is still physically holding Ctrl, whereas ^space::Send "{Blind}{Ctrl up}" allows Ctrl to be logically up even though it is physically down.
ja: 例えば、^space::Send "{Ctrl up}"は、ユーザーが物理的にCtrlを押したままであれば、自動的にCtrlを押し下げますが、^space::Send "{Blind}{Ctrl up}"では、物理的には下がっていても、論理的にはCtrlが上がっていることがあります。

source: For example, _H, 64, !ANSI would prefer AutoHotkey_H if available, 64-bit if compatible with the system, and finally Unicode over ANSI.
ja: 例えば、_H, 64, !ANSIは、AutoHotkey_Hがあればそれを選び、システムと互換性があれば64ビットを選び、最後にANSIよりもUnicodeを選びます。

source: For example, box := Box() will not work, because box and Box both resolve to the same thing.
ja: 例えば、box := Box()は、boxも Boxも同じものに解決されるため、機能しない。

source: For example, for , value in myMap calls myMap's enumerator with only its second parameter, omitting its first parameter.
ja: 例えば、for , value in myMap、myMapのenumeratorを第2パラメータのみで呼び出し、第1パラメータを省略します。

source: For example, local x declares a variable local to the current function, independent of any x in the outer function.
ja: 例えば、local xは、外側の関数のxとは無関係に、現在の関数にローカルな変数を宣言します。

source: For example, obj.%varname%() is the v2 equivalent of obj[varname]().
ja: 例えば、obj.%varname%()は、v2のobj[varname]()と同等です。

source: For example, return(var).
ja: 例えば、return(var)。

source: For example, x & y:: causes both x:: and x up:: to fire when x is released, where previously x:: never fired.
ja: 例えば、x & y::では、これまでx::が発射されることはなかったが、xを離すとx::とx up::の両方が発射されるようにします。

source: For example, x ** y ** z is evaluated as x ** (y ** z).
ja: 例えば、x ** y ** zはx ** (y ** z)と評価される。

source: For example, x := [] creates an object based on Array.Prototype, which means that the expressions x is Array and x.HasBase(Array.Prototype) are true, and type(x) returns "Array".
ja: 例えば、x := []はArray.Prototypeに基づくオブジェクトを作成する。これは、x is Arrayであり、x.HasBase(Array.Prototype)が真であり、type(x)が「Array」を返すことを意味する。

source: For example, x*(A_ScreenDPI/96) converts x from logical/GUI coordinates to physical/non-GUI coordinates.
ja: 例えば、x*(A_ScreenDPI/96)はxを論理/GUI座標から物理/非GUI座標に変換します。

source: For example, x-y performs subtraction while -x inverts the sign of x (producing a positive value from a negative value and vice versa).
ja: 例えば、x-yは引き算を行い、-xは xの符号を反転させる（負の値から正の値を生成し、その逆も同様）ことを意味します。

source: For example, {NumpadUp} would cause the Input command to be terminated by pressing Up, but ErrorLevel would contain EndKey:NumpadUp since only the VK is considered.
ja: 例えば、{NumpadUp}の場合、InputコマンドはUpを押すことで終了しますが、ErrorLevelはVKのみを考慮するため、EndKey:NumpadUpとなります。

source: For example, HotIf '!WinExist("Popup")' and HotIfWinNotExist "Popup" refer to the same hotkey variants.
ja: 例えば、HotIf '!WinExist("Popup")'とHotIfWinNotExist "Popup"は同じホットキー変種を参照しています。

source: For example, "GDI+ w100".
ja: 例えば、"GDI+ w100"。

source: For example, "HBITMAP:" handle.
ja: 例えば、"HBITMAP:" handle。

source: For example, "HBITMAP:*" handle.
ja: 例えば、"HBITMAP:*" handleです。

source: For example, "HICON:" handle.
ja: 例えば、"HICON:" handle。

source: For example, "User32\IsWindowVisible" produces the same result as "IsWindowVisible".
ja: 例えば、"User32\IsWindowVisible"は"IsWindowVisible"と同じ結果を得ることができる。

source: For example, "^!c" is the same as "!^c".
ja: 例えば、"^!c "は"!^c "と同じです。

source: For example, #ErrorStdOut "UTF-8" encodes error messages as UTF-8 before sending them to stderr.
ja: 例えば、#ErrorStdOut "UTF-8"は、エラーメッセージをUTF-8にエンコードしてからstderrに送ります。

source: For example, (a := 1, b := 2, c := 3) returns 3.
ja: 例えば、(a := 1, b := 2, c := 3)は3を返す。

source: For example, (x.y)() retrieves a function from a property and then calls it with no parameters, whereas x.y() would implicitly pass x as the first parameter.
ja: 例えば、(x.y)()はプロパティから関数を取得し、パラメータなしで呼び出すが、x.y()は最初のパラメータとして暗黙的にxを渡す。

source: For example, *^a::Send "{Blind^}b" would send Shift+B instead of Ctrl+Shift+B if Ctrl+Shift+A was pressed.
ja: 例えば、*^a::Send "{Blind^}b" は、Ctrl+Shift+Bではなく、Shift+Bを送信しますが、Ctrl+Shift+A が押し付けられた場合。

source: For example, +E0x40000 would add the WS_EX_APPWINDOW style, which provides a taskbar button for a window that would otherwise lack one.
ja: 例えば、+E0x40000は、WS_EX_APPWINDOWスタイルを追加し、タスクバーボタンがないウィンドウに、タスクバーボタンを提供します。

source: For example, -x or not keyIsDown.
ja: 例えば、-xまたは、not keyIsDown。

source: For example, /ErrorStdOut=UTF-8 encodes messages as UTF-8 before writing them to stderr.
ja: 例えば、/ErrorStdOut=UTF-8は、標準エラー出力に書き込む前にメッセージをUTF-8にエンコードする。

source: For example, /RunWith UIA.
ja: 例えば、/RunWith UIA。

source: For example, 1+1 or 2 * 5.
ja: 例えば、1+1 または 2 * 5。

source: For example, 200-0 would use 200 for the X coordinate and 0 for the Y.
ja: 例えば、200-0は、X座標に200、Y座標に0を使う。

source: For example, 3/2 yields 1.5 rather than 1, and 4/2 yields 2.0 rather than 2.
ja: 例えば、3/2は1ではなく1.5、4/2は2ではなく2.0となる。

source: For example, 5//3 is 1 and 5//-3 is -1.
ja: 例えば、5//3は1であり、5//-3は-1である。

source: For example, :X:~mb::MsgBox would cause a message box to be displayed when the user types "~mb" instead of auto-replacing it with the word "MsgBox".
ja: 例えば、:X:~mb::MsgBoxとすると、ユーザーが「~mb」と入力したときに、「MsgBox」という単語に自動置換されるのではなく、メッセージボックスが表示されるようになります。

source: For example, A_Index := 3 would make the loop statement act as though it is on the third iteration (A_Index will be 4 on the next iteration), while A_Index-- would prevent the current iteration from being counted toward the total.
ja: 例えば、A_Index := 3とすると、ループ文は3回目の反復にあるかのように動作し（次の反復ではA_Indexは4になります）、A_Index--は現在の反復が合計にカウントされないようにします。

source: For example, A_ScreenWidth/2.
ja: 例えば、A_ScreenWidth/2です。

source: For example, Chr(0x2010) Chr(0x0000) Chr(0x4030) produces the following string of bytes (due to UTF-16-LE encoding):
ja: 例えば、Chr(0x2010) Chr(0x0000) Chr(0x4030)は以下のバイト列を生成する（UTF-16-LEエンコーディングによる）：

source: For example, Chr(0x2010) Chr(0x0000) Chr(0x4030) produces the following string of bytes (due to UTF-16-LE encoding): 0x10, 0x20, 0, 0, 0x30, 0x40.
ja: 例えば、Chr(0x2010) Chr(0x0000) Chr(0x4030)は以下のバイト列を生成する（UTF-16-LEエンコーディングによる）：0x10、0x20、0、0、0x30、0x40。

source: For example, Click "100 200" clicks the left mouse button at a specific position.
ja: 例えば、Click "100 200"は、マウスの左ボタンを特定の位置でクリックすることができます。

source: For example, Click "Down" presses down the left mouse button and holds it.
ja: 例えば、Click "Down"は、マウスの左ボタンを押し下げ、そのまま保持します。

source: For example, Click "Right" clicks the right mouse button at the mouse cursor's current position.
ja: 例えば、Click "Right"すると、マウスカーソルの現在位置でマウスの右ボタンをクリックすることができます。

source: For example, Click 2 performs a double-click at the mouse cursor's current position.
ja: 例えば、Click 2は、マウスカーソルの現在位置でダブルクリックを行います。

source: For example, CurrentDate is the same as currentdate.
ja: 例えば、CurrentDateは currentdateと同じです。

source: For example, DirExist("Program*") may return attributes even though "Program*" is not a valid folder name.
ja: 例えば、DirExist("Program*")は、「Program*」が有効なフォルダ名でないにもかかわらず、属性を返す場合があります。

source: For example, DllCall("MyDll\MyFunc", "Ptr", MyStruct).
ja: 例えば、DllCall("MyDll\MyFunc", "Ptr", MyStruct)となります。

source: For example, E0x200 would add the WS_EX_CLIENTEDGE style, which provides a border with a sunken edge that might be appropriate for pictures and other controls.
ja: 例えば、E0x200では、WS_EX_CLIENTEDGE スタイルが追加され、画像やその他のコントロールに適した、縁がくぼんだボーダーを提供します。

source: For example, F1::return would disable F1.
ja: 例えば、F1::returnは F1を無効にする。

source: For example, FileExist("*.txt") may return attributes even though "*.txt" is not a valid filename.
ja: 例えば、FileExist("*.txt")は、「*.txt」が有効なファイル名でないにもかかわらず、属性を返す場合があります。

source: For example, FileObj.Pos(n) is not valid.
ja: 例えば、FileObj.Pos(n)は有効ではありません。

source: For example, FileSetAttrib(FileGetAttrib(file2), file1) copies the attributes of file2 to file1 (adding any that file2 has and removing any that it does not have).
ja: 例えば、FileSetAttrib(FileGetAttrib(file2), file1)は、file2の属性をfile1にコピーします（file2が持っているものは追加し、持っていないものは削除します）。

source: For example, FileSetAttrib(FileGetAttrib(file2), file1) copies the attributes of file2 to file1 (adding any that file2 have and removing any that it does not have).
ja: 例えば、FileSetAttrib(FileGetAttrib(file2), file1)は、file2の属性をfile1にコピーします（file2が持っているものは追加し、持っていないものは削除します）。

source: For example, Format("{:010}", 1) returns 0000000001.
ja: 例えば、Format("{:010}", 1)は、0000000001を返します。

source: For example, Goto MyLabel and Goto("MyLabel") both jump to MyLabel:.
ja: 例えば、Goto MyLabelと Goto("MyLabel")は、どちらもMyLabel:にジャンプします。

source: For example, HasBase(1, 0.base) returns true.
ja: 例えば、HasBase(1, 0.base)は真を返します。

source: For example, Method(Value, Parameters*).
ja: 例えば、Method(Value, Parameters*)のようなものです。

source: For example, MsgBox "Hello, world!", myGui.Show or x.y.z "my parameter".
ja: 例えば、MsgBox "Hello, world!",myGui.Showまたはx.y.z "my parameter"などです。

source: For example, MyArray[1]() would call the function contained by the first element of MyArray, while %MyVar%() would call the function contained by the variable whose name is contained by MyVar.
ja: 例えば、MyArray[1]()はMyArrayの最初の要素に含まれる関数を呼び出し、%MyVar%()はMyVarに含まれる名前の 変数に含まれる関数を呼び出します。

source: For example, MyVar ??
ja: 例えば、MyVar ?

source: For example, MyVar ?? "Default" is equivalent to IsSet(MyVar) ? MyVar : "Default".
ja: 例えば、MyVar ?? "Default" は、IsSet(MyVar) ? MyVar : "Default"と同等です。

source: For example, NumGet(var, "int") is valid.
ja: 例えば、NumGet(var, "int")は有効です。

source: For example, Numpad0 & Numpad1:: defines a hotkey which activates when you hold Numpad0 and press Numpad1.
ja: 例えば、Numpad0 & Numpad1::は、Numpad0を押しながらNumpad1を押したときに起動するホットキーを定義しています。

source: For example, Password* would make the masking character an asterisk rather than the black circle (bullet).
ja: 例えば、Password*はマスキング文字を黒丸ではなくアスタリスクにします。

source: For example, R10 would make the control 10 items tall.
ja: 例えば、R10はコントロールの高さを10にする。

source: For example, R10 would make the control 10 rows tall.
ja: 例えば、R10とすると、コントロールは10列の高さになります。
